## Terraform Plan - `global`

**📊 Plan Summary**
```
Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_repository_name = "mbocak-microservices-demo"
  + ecr_repository_url  = (known after apply)
```

<details>
<summary>📋 Show Full Plan</summary>

```terraform
2025-12-12T17:32:32.570Z [INFO]  Terraform version: 1.13.1
2025-12-12T17:32:32.570Z [INFO]  Go runtime version: go1.24.5
2025-12-12T17:32:32.570Z [INFO]  CLI args: []string{"/home/runner/work/_temp/0f915181-d6c2-4fe6-8613-0fb36d5a658d/terraform-bin", "plan", "-no-color", "-input=false", "-out=tfplan"}
2025-12-12T17:32:32.571Z [INFO]  CLI command args: []string{"plan", "-no-color", "-input=false", "-out=tfplan"}
2025-12-12T17:32:32.573Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=b438e14b-9fc7-bd8b-24be-a680aa8c29b1 tf_backend.s3.bucket=mbocak-kubernetes-tf-state-bucket tf_backend.s3.path=state/shared/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2025-12-12T17:32:33.013Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=b438e14b-9fc7-bd8b-24be-a680aa8c29b1 tf_backend.s3.bucket=mbocak-kubernetes-tf-state-bucket tf_backend.s3.path=state/shared/terraform.tfstate
2025-12-12T17:32:33.110Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=b438e14b-9fc7-bd8b-24be-a680aa8c29b1 tf_backend.s3.bucket=mbocak-kubernetes-tf-state-bucket tf_backend.s3.path=state/shared/terraform.tfstate
2025-12-12T17:32:33.691Z [INFO]  backend/local: starting Plan operation
2025-12-12T17:32:34.065Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=922a68d7-0c28-0330-0da8-12dc40810db9 tf_backend.s3.bucket=mbocak-kubernetes-tf-state-bucket tf_backend.s3.path=state/shared/terraform.tfstate
2025-12-12T17:32:34.167Z [INFO]  provider: configuring client automatic mTLS
2025-12-12T17:32:34.348Z [INFO]  provider.terraform-provider-aws_v6.26.0_x5: configuring server automatic mTLS: timestamp=2025-12-12T17:32:34.348Z
2025-12-12T17:32:35.424Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/aws/6.26.0/linux_amd64/terraform-provider-aws_v6.26.0_x5 id=2195
2025-12-12T17:32:35.425Z [INFO]  provider: configuring client automatic mTLS
2025-12-12T17:32:35.595Z [INFO]  provider.terraform-provider-aws_v6.26.0_x5: configuring server automatic mTLS: timestamp=2025-12-12T17:32:35.595Z
2025-12-12T17:32:35.730Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/aws/6.26.0/linux_amd64/terraform-provider-aws_v6.26.0_x5 id=2205
2025-12-12T17:32:35.730Z [INFO]  backend/local: plan calling Plan
2025-12-12T17:32:35.731Z [INFO]  provider: configuring client automatic mTLS
2025-12-12T17:32:35.897Z [INFO]  provider.terraform-provider-aws_v6.26.0_x5: configuring server automatic mTLS: timestamp=2025-12-12T17:32:35.897Z
2025-12-12T17:32:36.012Z [INFO]  provider.terraform-provider-aws_v6.26.0_x5: Retrieved credentials: @module=aws.aws-base tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=3ea30052-b26a-605d-2412-f3316f9017a9 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.69/logging/tf_logger.go:39 tf_rpc=ConfigureProvider timestamp=2025-12-12T17:32:36.012Z
2025-12-12T17:32:36.458Z [INFO]  provider.terraform-provider-aws_v6.26.0_x5: Retrieved caller identity from STS: tf_rpc=ConfigureProvider tf_mux_provider="*schema.GRPCProviderServer" @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.69/logging/tf_logger.go:39 @module=aws.aws-base tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=3ea30052-b26a-605d-2412-f3316f9017a9 timestamp=2025-12-12T17:32:36.458Z
2025-12-12T17:32:36.470Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.this, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
2025-12-12T17:32:36.480Z [INFO]  provider: plugin process exited: plugin=.terraform/providers/registry.terraform.io/hashicorp/aws/6.26.0/linux_amd64/terraform-provider-aws_v6.26.0_x5 id=2215
2025-12-12T17:32:36.481Z [INFO]  backend/local: plan operation completed
2025-12-12T17:32:36.481Z [INFO]  backend/local: writing plan output to: tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.retency_policy will be created
  + resource "aws_ecr_lifecycle_policy" "retency_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 tagged images (multi-arch safe)"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "invoice-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 1 day"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "eu-west-1"
      + registry_id = (known after apply)
      + repository  = "mbocak-microservices-demo"
    }

  # aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "mbocak-microservices-demo"
      + region               = "eu-west-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "env"     = "global"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all             = {
          + "env"     = "global"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_repository_name = "mbocak-microservices-demo"
  + ecr_repository_url  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

---
*Updated at: 2025-12-12T17:32:00Z*
<!-- Sticky Pull Request Commentterraform-plan-global -->